{
  "basics": {
    "name": "Luke Profio",
    "label": "AI/ML Product Manager @ Komatsu",
    "image": "",
    "email": "luke@profio.us",
    "phone": "(414) 396-0525",
    "url": "https://linktr.ee/profio",
    "summary": "Customer-oriented technology professional with 10 years of experience building and scaling innovative solutions at the intersection of business and technology.",
    "location": {
      "address": "2712 Broadway St",
      "postalCode": "CA 94115",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "AlbertEinstein",
        "url": "https://twitter.com/AlbertEinstein"
      }
    ]
  },
  "work": [
    {
      "name": "Komatsu North America",
      "position": "AI/ML Product Manager, Software Architecture",
      "url": "https://www.komatsu.com/en-us",
      "startDate": "2025",
      "endDate": null,
      "summary": "Managing the planning, delivery and continuous improvement of our ServiceNow ITSM, ITOM and SPM products, partnering with the AI/ML team to define, validate and deploy enterprise solutions, and focusing on delivering clear, measurable business outcomes for over 10,000 users globally.",
      "highlights": [
        "Leading integrations between ServiceNow ITOM and enterprise platforms (e.g. SAP, Palantir), increasing asset discovery coverage by and reducing unplanned downtime.",
        "Deploying ServiceNow Strategic Portfolio Management (SPM) to streamline project intake and approvals, cutting cycle time and boosting on-time delivery.",
        "Partnering with stakeholders to surface and prioritize high-value AI/ML use cases, unlocking annual savings through predictive maintenance and automation.",
        "Developing and maintaining a core AI/ML infrastructure roadmap, reducing model deployment time and standardizing data-science practices.",
        "Defining and tracking key metrics—MTTR, self-service adoption, model performance and ROI—to drive continuous improvement and ensure each release delivers impact to the business."
      ]
    },
        {
      "name": "The University of Texas at Austin",
      "position": "AI/ML Research Engineer",
      "url": "https://www.utexas.edu/",
      "startDate": "2024",
      "endDate": "2025",
      "summary": "",
      "highlights": [
        "Investigated and developed novel algorithms and models to advance machine learning and artificial intelligence theory and applications.",
        "Designed and ran experiments with datasets to evaluate performance, interpret results, and validate hypotheses.",
        "Published and shared research outcomes through peer-reviewed journals, conferences, and collaborations with the broader scientific community.",
        "Mentored and collaborated with students, faculty, and interdisciplinary teams to foster innovation and extend the impact of AI/ML research."
      ]
    },
        {
      "name": "The University of Texas at Austin",
      "position": "Graduate Teaching Assistant, AI/ML Engineering",
      "url": "https://www.utexas.edu/",
      "startDate": "2024",
      "endDate": "2025",
      "summary": "",
      "highlights": [
        "Conducted office hours and tutoring sessions with students to ensure their success in AI/ML courses.",
        "Graded assignments and provided constructive feedback, helping students understand their strengths and areas for improvement.",
        "Collaborated with faculty to improve course materials, integrating the latest research and instructional methods.", 
        "Mentored students and fostered an inclusive learning environment, encouraging curiosity, critical thinking, and a passion for AI/ML."
      ]
    },
        {
      "name": "Carnegie Mellon University",
      "position": "Founder, AI@CMU",
      "url": "https://www.cmu.edu/",
      "startDate": "2022",
      "endDate": null,
      "summary": "",
      "highlights": [
        "Co-founded and shaped the strategic direction of AI@CMU, a student- and alumni-led initiative focused on expanding access to AI/ML education, hands-on tooling, and career development.",
        "Leading workshops, speaker events, and mentorship programs to equip students with practical AI/ML skills using industry-relevant tools and frameworks.",
        "Building partnerships with faculty, research labs, and tech companies to connect members with resources, projects, and applied learning opportunities in AI/ML."
      ]
    },
        {
      "name": "Aurifex",
      "position": "Chief Executive Officer & Founder",
      "url": "",
      "startDate": "2022",
      "endDate": null,
      "summary": "",
      "highlights": [
        "Leading the cross-functional delivery of AI/ML solutions across Fortune 500 and nonprofit organizations, accelerating innovation and reducing time-to-ROI.",
        "Translating complex stakeholder needs into product roadmaps and scalable architectures that align with mission-critical business objectives.",
        "Overseeing multi-team agile delivery cycles, managing scope, cost, and risk while ensuring high client satisfaction and measurable outcomes.",
        "Driving strategic portfolio planning and governance, enabling data-informed prioritization and resource allocation to boost operational efficiency across product streams."
      ]
    },
        {
      "name": "Startup Founder",
      "position": "Carnegie Mellon University, Swartz Center for Entrepreneurship",
      "url": "",
      "startDate": "2022",
      "endDate": null,
      "summary": "",
      "highlights": [
        "Founded Aurifex, leading the cross-functional delivery of AI/ML solutions across Fortune 500 and nonprofit organizations, accelerating innovation and reducing time-to-ROI.",
        "Translating complex stakeholder needs into product roadmaps and scalable architectures that align with mission-critical business objectives.",
        "Overseeing multi-team agile delivery cycles, managing scope, cost, and risk while ensuring high client satisfaction and measurable outcomes.",
        "Driving strategic portfolio planning and governance, enabling data-informed prioritization and resource allocation to boost operational efficiency across product streams."
      ]
    },
            {
      "name": "Carnegie Mellon University",
      "position": "AI/ML Research Engineer",
      "url": "https://www.cmu.edu/",
      "startDate": "2022",
      "endDate": "2025",
      "summary": "",
      "highlights": [
        "Investigated and developed novel algorithms and models to advance machine learning and artificial intelligence theory and applications.",
        "Designed and ran experiments with datasets to evaluate performance, interpret results, and validate hypotheses.",
        "Published and shared research outcomes through peer-reviewed journals, conferences, and collaborations with the broader scientific community.",
        "Mentored and collaborated with students, faculty, and interdisciplinary teams to foster innovation and extend the impact of AI/ML research."
      ]
    },
        {
      "name": "CODAworx",
      "position": "CODAmarket Co-Founder & Investor",
      "url": "https://codaworx.com/",
      "startDate": "2021",
      "endDate": null,
      "summary": "Built and scaled a SaaS eCommerce platform that connects art buyers and commissioners with creators, redefining how artists expand their reach and monetize their artwork.",
      "highlights": [
        "Led the end-to-end design, development, and scaling of the platform with a team of 8+ associates.",
        "Significantly increased customer retention through targeted outreach and self-service user onboarding and training.",
        "Optimized transaction efficiency and enhanced user experience by redesigning inventory management systems using A/B testing and user analytics."
      ]
    },
        {
      "name": "CODAworx",
      "position": "Technical Product Manager, eCommerce",
      "url": "https://codaworx.com/",
      "startDate": "2021",
      "endDate": "2023",
      "summary": "Built and scaled a SaaS eCommerce platform that connects art buyers and commissioners with creators, redefining how artists expand their reach and monetize their artwork.",
      "highlights": [
        "Led the end-to-end design, development, and scaling of the platform with a team of 8+ associates.",
        "Significantly increased customer retention through targeted outreach and self-service user onboarding and training.",
        "Optimized transaction efficiency and enhanced user experience by redesigning inventory management systems using A/B testing and user analytics."
      ]
    },
            {
      "name": "CODAworx",
      "position": "Software Engineer, eCommerce",
      "url": "https://codaworx.com/",
      "startDate": "2021",
      "endDate": "2023",
      "summary": "Built and scaled a SaaS eCommerce platform that connects art buyers and commissioners with creators, redefining how artists expand their reach and monetize their artwork.",
      "highlights": [
        "Led the end-to-end design, development, and scaling of the platform with a team of 8+ associates.",
        "Significantly increased customer retention through targeted outreach and self-service user onboarding and training.",
        "Optimized transaction efficiency and enhanced user experience by redesigning inventory management systems using A/B testing and user analytics."
      ]
    },
        {
      "name": "UW-Madison",
      "position": "Advisory Board Member, AI/ML Engineering",
      "url": "https://www.wisc.edu/",
      "startDate": "2023",
      "endDate": "2025",
      "summary": "",
      "highlights": [
        "Served on UW-Madison's Applied Data Science advisory board, influencing the development of novel curriculum to align with industry trends (e.g. AI/ML model development)."
      ]
    },
        {
      "name": "American Red Cross",
      "position": "Program Manager, National Scheduling Division",
      "url": "https://www.redcross.org",
      "startDate": "2020",
      "endDate": "2022",
      "summary": "",
      "highlights": [
        "Managed a team of 10+ associates as a part of the American Red Cross' national scheduling division, which recruited blood donors across the globe.",
        "Implemented and optimized processes that increased efficiency, grew the donor base, and improved the scheduler and donor experience.",
        "Collaborated with technology teams to support in the implementation of system enhancements, which resolved bugs and improved the user experience."
      ]
    },
        {
      "name": "UW-Madison",
      "position": "Board Member, International Society for Regenerative Medicine",
      "url": "https://www.wisc.edu",
      "startDate": "2017",
      "endDate": "2022",
      "summary": "",
      "highlights": [
        "Co-founded and provided advisory support on the vision, mission, and goals of the International Society for Regenerative Medicine.",
        "Led global technology initiatives including webinars and conferences aimed at showcasing novel regenerative medicine research.",
        "Provided operational support for the organization, helping recruit members, grow support for organizational initiatives, and scale its overall impact."
      ]
    },
        {
      "name": "UW-Madison",
      "position": "Board Member, Cardiac on Campus",
      "url": "https://www.wisc.edu",
      "startDate": "2016",
      "endDate": "2020",
      "summary": "",
      "highlights": [
        "Managed and scaled community engagement through new fundraising events, notably a basketball tournament which also raised awareness for cardiovascular disease.",
        "Collaborated with the board to implement enhancements and optimized processes which streamlined the organization's operations and mission in raising awareness for cardiovascular disease.",
        "Facilitated various organizational events, including talks on the research and impact of cardiovascular treatment."
      ]
    },
        {
      "name": "Sendik's Food Market",
      "position": "Assistant Manager",
      "url": "https://www.sendiksfinefoods.com/",
      "startDate": "2014",
      "endDate": "2017",
      "summary": "",
      "highlights": [
        "Led store operations and team coordination across grocery, dairy, and frozen departments, improving stock availability and shelf compliance.",
        "Implemented inventory control strategies that reduced shrink and spoilage by identifying ordering inefficiencies and optimizing backstock flow.",
        "Trained and supervised grocery staff, enhancing customer service consistency and reducing labor turnover through team development initiatives (e.g. training courses).",
        "Collaborated with regional vendors and corporate buyers to execute seasonal promotions and streamline product assortments, driving category sales."
      ]
    },
        {
      "name": "Grasch Foods Inc.",
      "position": "Assistant Manager",
      "url": "",
      "startDate": "2012",
      "endDate": "2014",
      "summary": "",
      "highlights": [
        "Led store operations and team coordination across grocery, dairy, and frozen departments, improving stock availability and shelf compliance.",
        "Implemented inventory control strategies that reduced shrink and spoilage by identifying ordering inefficiencies and optimizing backstock flow.",
        "Trained and supervised grocery staff, enhancing customer service consistency and reducing labor turnover through team development initiatives (e.g. training courses).",
        "Collaborated with regional vendors and corporate buyers to execute seasonal promotions and streamline product assortments, driving category sales."
      ]
    },
        {
      "name": "Boy Scouts of America",
      "position": "Patrol Leader",
      "url": "https://www.scouting.org/",
      "startDate": "2010",
      "endDate": "2012",
      "summary": "",
      "highlights": [
        "Led a patrol of 10+ scouts, planning and facilitating weekly meetings, campouts, and advancement activities to ensure engagement and progression of skills.",
        "Served as the primary liaison between the troop leadership and patrol members, communicating responsibilities and resolving conflicts to promote team building.",
        "Organized patrol duties during outings, ensuring the execution of meal prep, campsite setup, and safety practices.",
        "Mentored younger scouts, fostering leadership, accountability, and personal growth through peer instruction and engagement."
      ]
    },
        {
      "name": "Boy Scouts of America",
      "position": "Senior Patrol Leader",
      "url": "https://www.scouting.org/",
      "startDate": "2012",
      "endDate": "2016",
      "summary": "",
      "highlights": [
        "Elected as the highest-ranking youth leader, overseeing the entire troop’s operations of 20+ scouts, including planning, delegation, and execution of troop activities and meetings.",
        "Coordinated and supervised the Patrol Leaders’ Council (PLC), setting agendas and facilitating decision-making for troop-wide events, training, and progression.",
        "Led troop-wide communications, representing youth interests in collaboration with adult leaders to align programming with the BSA’s values and goals.",
        "Developed and coached emerging youth leaders, cultivating a culture of responsibility, initiative, and servant leadership across all patrols."
      ]
    },
        {
      "name": "Workday",
      "position": "AI/ML Product Manager",
      "url": "https://www.workday.com/",
      "startDate": "2024",
      "endDate": "2025",
      "summary": "Contributed to Workday's ML/AI product roadmap by identifying scalable solutions that reduce costs, mitigate enterprise risk, and enhance the user experience for 70M+ users globally.",
      "highlights": [
        "Developed a comprehensive market map of relevant ML/AI solutions, identifying 8 high-yield strategic partnerships aligned with Workday's objectives.",
        "Led a research initiative in collaboration with design, engineering, and leadership teams to iteratively develop artifacts, gather feedback, and align on prioritization.",
        "Presented findings to cross-functional stakeholders, enterprise clients, and customers, incorporating feedback to increase visibility and engagement with Workday’s initiatives."
      ]
    },
        {
      "name": "UW Health",
      "position": "Senior AI/ML Product Manager, Medical Informatics",
      "url": "https://www.uwhealth.org/",
      "startDate": "2023",
      "endDate": "2025",
      "summary": "Built and scaled healthcare IT products (Best Buy Health RPM, Apple Health, Epic Systems, Azure OpenAI, UiPath RPA, Stryker, Vocera, MacOS, GenAI, AI/ML) to reduce clinician burnout, costs, enterprise risk, and improve the quality of healthcare.",
      "highlights": [
        "Developed and prioritized an AI/ML product roadmap featuring 50+ high yield use cases for Epic’s EHR system through user story mapping, OKRs, market research and stakeholder engagement.",
        "Managed the creation of a quantitative user feedback pipeline in Databricks and analyzed qualitative survey data, enabling faster iterations and enhanced AI/ML tools.",
        "Launched 3 GenAI products to automate clinical workflows, effectively reducing clinician burnout and enhancing user experience.",
        "Conducted user interviews and usability studies to drive iterative design improvements, prompt engineering and resolve pain points, increasing user satisfaction scores.",
        "Mentored team members on AI/ML tools, product management, and PMO best practices (e.g. ServiceNow SPM), boosting team productivity."
      ]
    },
        {
      "name": "Manifold Research",
      "position": "AI/ML Program Manager, Open Source",
      "url": "https://www.manifoldrg.com",
      "startDate": "2024",
      "endDate": "2025",
      "summary": "Built and scaled AI/ML products that reduced costs and enhanced the operability of emerging technologies for academic and enterprise organizations.",
      "highlights": [
        "Recruited and led a cross-functional global research team, leveraging agile methodologies to develop and launch open-source AI/ML products that cut costs through model optimization and innovative research methods.",
        "Hosted bi-weekly technical seminars and provided regular updates on open-source initiatives, doubling the core team size.",
        "Boosted community engagement by 60% in under 6 months through targeted research initiatives and strategic communication efforts."
      ]
    },
        {
      "name": "JASCI Software",
      "position": "Technical Program Director, Software Engineering",
      "url": "https://www.jascicloud.com/",
      "startDate": "2022",
      "endDate": "2024",
      "summary": "",
      "highlights": [
        "Led full-cycle WMS and WCS implementations for Fortune 500 clients with up to 10X efficiency improvement.",
        "Delivered 8 major WMS/WCS implementation projects resulting in significant client ROI and operational gains.",
        "Reduced picking time by 70% through WCS integration, increased warehouse throughput by 300% via automation.",
        "Supervised industrial engineering team and served as project lead for multi-million-dollar logistics solutions.",
        "Designed scalable, repeatable WMS implementations to support rapid customer onboarding and growth.",
        "Spearheaded robotic and automated warehouse system integrations (AMRs, conveyors, WCS layer).",
        "Conducted in-depth data analysis using complex SQL queries to produce performance and cost benchmarks."
      ]
    },
        {
      "name": "Labcorp",
      "position": "Associate Technical Project Manager, Pharmaceuticals",
      "url": "https://www.labcorp.com/",
      "startDate": "2021",
      "endDate": "2022",
      "summary": "Co-led product launches and compliance initiatives for high-budget pharmaceuticals, ensuring regulatory compliance and boosting client market share.",
      "highlights": [
        "Co-led cross-functional teams of 35+ associates to launch 2 pharmaceutical products with a $20M+ budget, boosting client market share.",
        "Managed a $200K+ global investigator training initiative, tailoring materials based on client feedback and achieving high satisfaction scores.",
        "Implemented and optimized compliance tracking processes that reduced audit preparation time and increased global regulatory compliance."
      ]
    },
        {
      "name": "UW-Madison",
      "position": "Technical Project Manager & Researcher, Regenerative Medicine",
      "url": "https://www.wisc.edu/",
      "startDate": "2016",
      "endDate": "2021",
      "summary": "",
      "highlights": [
        "Co-led the development of regenerative medicine products aimed at improving the effectiveness and quality of heart disease treatment.",
        "Co-led a global team of 18 researchers and co-authored a publication cited by 30+ academic and industry organizations including the American Heart Association, advancing cardiovascular medicine, and improving patient outcomes.",
        "Utilized agile methodologies to enhance the efficiency of cardiac tissue regeneration, paving the way for pre-clinical product development and commercialization.",
        "Developed data analytics workflows using instrumentation software and programming, reducing processing time while improving data accuracy and quality."
      ]
    },
        {
      "name": "UW-Madison",
      "position": "Software Engineer",
      "url": "https://www.wisc.edu/",
      "startDate": "2019",
      "endDate": "2021",
      "summary": "",
      "highlights": [
        "Delivered scalable, high-performance web applications that improved load times and supported traffic growth.",
        "Engineered secure, API-driven backends and responsive front-end interfaces, enabling integrations with third-party services and reducing error rates.",
        "Partnered with product and design teams to launch user-centric features, increasing engagement and retention while maintaining accessibility and compliance standards."
      ]
    },
        {
      "name": "Merck Group",
      "position": "Associate Research Scientist, Chemical Engineering",
      "url": "https://www.emdgroup.com/en",
      "startDate": "2021",
      "endDate": "2022",
      "summary": "",
      "highlights": [
        "Developed and optimized pharmaceutical production protocols, applying informatics and analytical chemistry to support the formulation and scale-up of new chemical artifacts.",
        "Executed high-precision chemical manufacturing procedures in both lab-scale and large-scale environments, ensuring compliance with GMP and internal quality standards.",
        "Contributed to method development and analytical evaluations across various stages of drug production, driving process improvements and enhanced reproducibility of products.",
        "Participated in safety audits, cross-functional documentation updates, and knowledge transfer efforts—helping onboard new personnel and standardize best practices in pharmaceutical production."
      ]
    },
        {
      "name": "Gallify",
      "position": "Chief Technology Officer & Founder",
      "url": "",
      "startDate": "2017",
      "endDate": "2019",
      "summary": "",
      "highlights": [
        "Led the development and deployment of blockchain-integrated AR features using Solidity, Apple ARKit, Object Capture API, and GCP, enabling real-time NFT creation and interactive gallery experiences.",
        "Oversaw 6 concurrent projects across 4 engineering teams of 10+ associates, driving on-time delivery and aligning product milestones with strategic objectives.",
        "Served as a Scrum Master and the primary technical decision-maker, accelerating development cycles and streamlining team workflows through structured sprints and async updates.",
        "Built and scaled internal operations by leading recruitment, creating hiring packages, and implementing financial/resource planning tools, contributing to team growth and operational efficiency."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "UW Health",
      "location": "Madison, Wisconsin",
      "position": "Volunteer",
      "url": "https://www.uwhealth.org/",
      "startDate": "2017",
      "endDate": "2020",
      "summary": "",
      "highlights": []
    },
    {
      "organization": "National Eagle Scout Association",
      "location": "Washington DC",
      "position": "Eagle Scout",
      "url": "https://nesa.org/",
      "startDate": "2013",
      "endDate": null,
      "summary": "",
      "highlights": []
    },
        {
      "organization": "National Alliance on Mental Illness",
      "location": "Chicago, Illinois",
      "position": "Volunteer",
      "url": "https://www.nami.org/",
      "startDate": "2025",
      "endDate": null,
      "summary": "",
      "highlights": []
    },
            {
      "organization": "Madison Area Technical College",
      "location": "Madison, Wisconsin",
      "position": "Volunteer",
      "url": "https://madisoncollege.edu/",
      "startDate": "2023",
      "endDate": "2024",
      "summary": "",
      "highlights": []
    },
            {
      "organization": "SSM Health",
      "location": "Madison, Wisconsin",
      "position": "Volunteer",
      "url": "https://www.ssmhealth.com/",
      "startDate": "2023",
      "endDate": "2024",
      "summary": "",
      "highlights": []
    },
            {
      "organization": "Boy Scouts of America",
      "location": "Milwaukee, Wisconsin",
      "position": "Volunteer",
      "url": "https://www.scouting.org/",
      "startDate": "2005",
      "endDate": "2016",
      "summary": "",
      "highlights": []
    },
            {
      "organization": "Ronald McDonald House Charities",
      "location": "Madison, Wisconsin",
      "position": "Volunteer",
      "url": "https://rmhc.org/",
      "startDate": "2013",
      "endDate": "2017",
      "summary": "",
      "highlights": []
    }
  ],
  "education": [
        {
      "institution": "Elmbrook Schools",
      "location": "Elm Grove, Wisconsin",
      "url": "https://www.elmbrookschools.org/",
      "area": "General Education",
      "studyType": "K-12, High School Diploma",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": [
        "AP Scholar with Distinction",
        "Honor Roll"
      ]
    },
            {
      "institution": "University of Wisconsin, Madison",
      "location": "Madison, Wisconsin",
      "url": "https://www.wisc.edu/",
      "area": "Genetics, Biological Science",
      "studyType": "Bachelor of Science (BSc)",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": [
        "Albert J. & Adelaide E. Riker Academic Merit Scholarship",
        "Spring Forward Academic Merit Scholarship",
        "William F. Vilas Academic Merit Scholarship",
        "Qualtrics Academic Merit Scholarship",
        "Distinctive Scholastic Achievement",
        "Regenerative Medicine Certificate",
        "Graduated in 3 Years",
        "Dean's List"
      ]
    },
        {
      "institution": "University of Colorado, Boulder",
      "location": "Boulder, Colorado",
      "url": "https://www.colorado.edu/home",
      "area": "Data Science, Mathematical Science",
      "studyType": "Master of Engineering (MEng)",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": [
        "Academic Merit Scholarship",
        "Dean's List"
      ]
    },
        {
      "institution": "The University of Texas at Austin",
      "location": "Austin, Texas",
      "url": "https://www.utexas.edu/",
      "area": "Artificial Intelligence, Mathematical Science",
      "studyType": "Master of Science (MSc)",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": [
        "Academic Merit Scholarship",
        "Dean's List"
      ]
    },
        {
      "institution": "Carnegie Mellon Univeristy",
      "location": "Pittsburgh, Pennsylvania",
      "url": "https://www.cmu.edu/",
      "area": "Product Management, Technology Strategy",
      "studyType": "Master of Business Administration (MBA)",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": [
        "David A. Tepper Academice Merit Scholarship",
        "Software Engineering Graduate Certificate",
        "Swartz Center for Entrepreneurship",
        "Dean's List"
      ]
    },
        {
      "institution": "Massachusetts Institute of Technology",
      "location": "Boston, Massachusetts",
      "url": "https://www.mit.edu/",
      "area": null,
      "studyType": "CTO Program",
      "startDate": null,
      "endDate": null,
      "score": "10",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Eagle Scout",
      "date": "",
      "awarder": "Boy Scouts of America",
      "url": "",
      "summary": ""
    },
    {
      "title": "Academic Merit Scholarship",
      "date": "",
      "awarder": "Carnegie Mellon University",
      "url": "",
      "summary": ""
    },
    {
      "title": "Academic Merit Scholarship",
      "date": "",
      "awarder": "University of Texas at Austin",
      "url": "",
      "summary": ""
    },
    {
      "title": "Academic Merit Scholarship",
      "date": "",
      "awarder": "UC-Boulder",
      "url": "",
      "summary": ""
    },
    {
      "title": "Albert J. & Adelaide E. Riker Academic Merit Scholarship",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "Spring Forward Academic Merit Scholarship",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "William F. Vilas Academic Merit Scholarship",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "Qualtrics Academic Merit Scholarship",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "Distinctive Scholastic Achivement",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "Dean's List",
      "date": "",
      "awarder": "Carnegie Mellon University",
      "url": "",
      "summary": ""
    },
    {
      "title": "Dean's List",
      "date": "",
      "awarder": "The University of Texas at Austin",
      "url": "",
      "summary": ""
    },
    {
      "title": "Dean's List",
      "date": "",
      "awarder": "UC-Boulder",
      "url": "",
      "summary": ""
    },
    {
      "title": "Dean's List",
      "date": "",
      "awarder": "UW-Madison",
      "url": "",
      "summary": ""
    },
    {
      "title": "AP Scholar with Distinction",
      "date": "",
      "awarder": "Elmbrook Schools",
      "url": "",
      "summary": ""
    },
    {
      "title": "Honor Roll",
      "date": "",
      "awarder": "Elmbrook Schools",
      "url": "",
      "summary": ""
    },
    {
      "title": "1st Place",
      "date": "",
      "awarder": "National Federation of Music Clubs",
      "url": "",
      "summary": ""
    },
    {
      "title": "Exemplary Soloist",
      "date": "",
      "awarder": "National Federation of Music Clubs",
      "url": "",
      "summary": ""
    },
    {
      "title": "1st Place",
      "date": "",
      "awarder": "Wisconsin Music Teacher's Association",
      "url": "",
      "summary": ""
    },
    {
      "title": "Exemplary Soloist",
      "date": "",
      "awarder": "Wisconsin Music Teacher's Association",
      "url": "",
      "summary": ""
    },
    {
      "title": "1st Place",
      "date": "",
      "awarder": "Milwaukee Music Teacher's Association",
      "url": "",
      "summary": ""
    },
    {
      "title": "1st Place",
      "date": "",
      "awarder": "Wisconsin State Music Association",
      "url": "",
      "summary": ""
    }
  ],
  "certificates": [
    {
      "name": "Artificial Intelligence",
      "date": "",
      "issuer": "Stanford University School of Engineering",
      "url": "https://engineering.stanford.edu/",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Regenerative Medicine",
      "date": "",
      "issuer": "UW-Madison",
      "url": "https://www.med.wisc.edu/",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Surgery",
      "date": "",
      "issuer": "UW-Madison",
      "url": "https://www.med.wisc.edu/",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Project Management Professional (PMP)",
      "date": "",
      "issuer": "Project Management Institute",
      "url": "https://www.pmi.org",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Certified Scrum Product Owner (CSPO)",
      "date": "",
      "issuer": "Scrum Alliance",
      "url": "https://www.scrumalliance.org/",
      "icon": "fa-solid fa-clipboard-check"
    },
    {
      "name": "Product Management",
      "date": "",
      "issuer": "Carnegie Mellon University",
      "url": "https://www.cmu.edu/",
      "icon": "fa-solid fa-clipboard-check"
    }
  ],
  "publications": [
    {
      "name": "The Evolution of Biological Machine Learning",
      "publisher": "Carnegie Mellon University, Department of Computer Science",
      "releaseDate": "2025",
      "url": "https://drive.google.com/file/d/1gLKFLwOumd0T9OC0pjdUIOzYyPnKzNwk/view?usp=share_link",
      "summary": "Biological Machine Learning (BioML) has evolved over the past several years, and new models have dramatically advanced genomics, proteomics, metabolomics, systems biology, drug discovery, and clinical diagnostics. This survey provides an in-depth overview of BioML models developed, focusing on research breakthroughs and performance benchmarks. We categorize approaches by learning paradigm (supervised, unsupervised, transfer, self-supervised, and generative models) and by application domain. In genomics, deep learning—especially transformer-based architectures—now analyzes DNA regulatory code and variant effects with remarkable accuracy. In proteomics, research breakthroughs like AlphaFold have achieved near-experimental accuracy in protein 3D structural prediction, while large protein language models learn functional properties from sequence data. Metabolomics and systems biology are leveraging AI to integrate high-dimensional -omics data, improving the classification of diseases. Drug discovery has utilized these technologies for molecular property prediction, de-novo drug design, and protein--ligand docking, reaching state-of-the-art results (e.g. diffusion models that outperform traditional virtual screening). In clinical diagnostics, these models rival expert accuracy in detecting diseases from genomic and imaging data. We discuss and compare leading models in each domain, highlight their performance improvements over prior methods, and organize them into a coherent taxonomy; as a part of this, limitations are examined, along with future directions."
    },
    {
      "name": "A Machine Learning Approach Toward the Detection of Lung Cancer",
      "publisher": "The University of Texas at Austin, Department of Computer Science",
      "releaseDate": "2025",
      "url": "https://drive.google.com/file/d/1RxvSYO-OD_2PKPfNMMx6c2M25g-L6WUE/view?usp=sharing",
      "summary": "Lung cancer remains the leading cause of cancer-related mortality worldwide, yet early detection significantly improves patient survival rates. This project investigates whether a machine learning model can estimate lung cancer risk based on a brief survey capturing key demographic, lifestyle, and symptom-related factors. Using a public synthetic dataset of approximately 300 individuals with 15 features (including age, gender, smoking history, and binary indicators for various symptoms and habits), we developed and evaluated two classifiers: logistic regression and random forest. Model development involved data preprocessing, feature engineering, and hyperparameter tuning via cross-validation. On a held-out test set, both models achieved high performance, with accuracy ranging from 82% to 89% and ROC AUC scores near 0.95. Analysis revealed that respiratory symptoms and alcohol consumption were among the strongest predictors of lung cancer risk, consistent with epidemiological evidence. To enhance interpretability, we applied SHAP (SHapley Additive Explanations) to assess feature contributions for individual predictions, confirming that the models' decision patterns aligned with clinical capabilities. While the dataset and scope limit direct clinical application, the findings highlight the potential of lightweight, survey-based predictive tools for early lung cancer risk screening."
    },
    {
      "name": "Healthcare Cybersecurity in the Modern Age",
      "publisher": "Carnegie Mellon University, Department of Computer Science",
      "releaseDate": "2025",
      "url": "https://drive.google.com/file/d/1hu3E0nU4IaWRfLGCvj2pnmUXQBPqJes1/view?usp=share_link",
      "summary": "Protecting patient health information is a critical priority in modern healthcare. Electronic health records (EHRs), medical devices, and digital health apps have greatly expanded the volume of sensitive data, making healthcare a prime target for cyberattacks. In the United States alone, 2023 saw 725 healthcare data breaches reported to federal authorities, exposing over 133 million patient records. Such breaches not only undermine patient privacy but also erode the trust essential to effective care. Ensuring the security of patient data requires addressing conventional cybersecurity threats—from ransomware to insider misuse—while also leveraging cutting-edge technologies. In recent years, artificial intelligence (AI) and machine learning (ML) have emerged as powerful tools to enhance security by detecting threats and preserving privacy. This survey provides a comprehensive review of cybersecurity as it pertains to patient data protection. We focus on the U.S. regulatory environment, including laws like HIPAA (Health Insurance Portability and Accountability Act), HITECH (Health Information Technology for Economic and Clinical Health Act), and the 21st Century Cures Act, which establish strict rules for safeguarding health data. We explore key domains of patient data security—EHR security, biometric data protection, federated learning for health data, intelligent threat detection systems, data anonymization to prevent re-identification, and secure data-sharing protocols. For each area, we examine traditional challenges (e.g., ransomware attacks, insider threats, data breaches) and highlight AI-driven solutions. We also analyze important ML techniques such as anomaly detection, adversarial machine learning, and privacy-preserving ML, discussing how they apply to healthcare security. Throughout, we address legal and ethical considerations for patient data security in the U.S., ensuring that technical measures align with regulatory requirements and patient rights. The goal is to provide a structured academic overview of the state of cybersecurity for patient data and how AI/ML innovations are helping protect healthcare information in an evolving threat landscape."
    },
    {
      "name": "Prompt Engineering GPT-4 to Answer Patient Inquiries: A Real-Time Implementation in the Electronic Health Record across Provider Clinics",
      "publisher": "UW-Health, Department of Medical Informatics",
      "releaseDate": "2025",
      "url": "https://sail.health/wp-content/uploads/2024/05/Poster-9-Patterson.pdf",
      "summary": "As LLMs evolve, the role of prompt engineering has become critical to successful deployment. The University of Wisconsin Health system is part of an Epic Systems Corp (Epic) initiative to use GPT-4 to provide healthcare providers with draft responses to patients' messages to clinicians. This study examined a pre-post design comparing crowd-sourced manual prompts to a novel semi-automated prompt design approach. We hypothesized that using a semi-automated approach to prompt engineering would increase the usability of the generated output in providers responding to patient inquiries."
    },
    {
      "name": "Rates of Transient Hypoparathyroidism Post-Thyroidectomy - It is All in the Definition",
      "publisher": "UW-Health, Department of Surgery",
      "releaseDate": "2020",
      "url": "https://drive.google.com/file/d/13VV5WaQiIjfltAaMlpOqYBECuUA0RUK0/view",
      "summary": "Transient hypoparathyroidism is the most common complication after total thyroidectomy, but unfortunately there is no single accepted definition for this postoperative complication. The lack of a universal definition makes it impossible to compare outcomes across institutions or registries. Although institution specific incidences can be reported to patients in select cases, this is not unanimously applicable. This is problematic because patient education and expectations regarding the true incidence of this common complication are unclear which creates deficiencies in the consent process. As a result of the variability in the definition of postoperative transient hypoparathyroidism, we see inconsistent treatment protocols, potentially delayed hospital discharges and increased healthcare costs. It is difficult to establish best practices when we are not all measuring the same outcome."
    },
    {
      "name": "Epigenetic Priming of Human Pluripotent Stem Cell-Derived Cardiac Progenitor Cells Accelerates Cardiomyocyte Maturation",
      "publisher": "Oxford Academic",
      "releaseDate": "2019",
      "url": "https://academic.oup.com/stmcls/article/37/7/910/6430674",
      "summary": "Human pluripotent stem cell-derived cardiomyocytes (hPSC-CMs) exhibit a fetal phenotype that limits in vitro and therapeutic applications. Strategies to promote cardiomyocyte maturation have focused interventions on differentiated hPSC-CMs, but this study tests priming of early cardiac progenitor cells (CPCs) with polyinosinic-polycytidylic acid (pIC) to accelerate cardiomyocyte maturation. CPCs were differentiated from hPSCs using a monolayer differentiation protocol with defined small molecule Wnt temporal modulation, and pIC was added during the formation of early CPCs. pIC priming did not alter the expression of cell surface markers for CPCs, expression of common cardiac transcription factors, or final purity of differentiated hPSC-CMs. However, CPC differentiation in basal medium revealed that pIC priming resulted in hPSC-CMs with enhanced maturity manifested by increased cell size, greater contractility, faster electrical upstrokes, increased oxidative metabolism, and more mature sarcomeric structure and composition. To investigate the mechanisms of CPC priming, RNAseq revealed that cardiac progenitor-stage pIC modulated early Notch signaling and cardiomyogenic transcriptional programs. Chromatin immunoprecipitation of CPCs showed that pIC treatment increased deposition of the H3K9ac activating epigenetic mark at core promoters of cardiac myofilament genes and the Notch ligand, JAG1. Inhibition of Notch signaling blocked the effects of pIC on differentiation and cardiomyocyte maturation. Furthermore, primed CPCs showed more robust formation of hPSC-CMs grafts when transplanted to the NSGW mouse kidney capsule. Overall, epigenetic modulation of CPCs with pIC accelerates cardiomyocyte maturation enabling basic research applications and potential therapeutic uses."
    },
    {
      "name": "Abstract 17323: Polyinosinic-Polycytidylic Acid Primes Cardiac Progenitors From Human Induced Pluripotent Stem Cells for Enhanced Cell Therapy and Cardiomyocyte Maturation",
      "publisher": "American Heart Association",
      "releaseDate": "2018",
      "url": "https://www.ahajournals.org/doi/abs/10.1161/circ.138.suppl_1.17323",
      "summary": "Cardiomyocytes derived from human induced pluripotent stem cells (hiPS-CMs) hold promise for disease modeling, drug discovery, and therapy, but the challenge remains to create mature cardiomyocytes like those found in the adult heart. While groups have increased the maturity of hiPS-CMs in extended culture with electrical, metabolic, and mechanical stimulation, we hypothesized that epigenetic modulation during the formation of cardiac progenitors (hiPS-CPCs) could enhance their capacity to form mature CMs. We found that priming with the innate immune agonist polyinosinic-polycytidylic acid (pIC) decreased cardiac lineage-HDAC expression during the formation of hiPS-CPCs in defined small molecule monolayer differentiation. While both untreated and primed day 5 hiPS-CPCs contained equivalent >80% purity of KDR+PDGRF alpha + CPC populations, gene expression studies using RNAseq demonstrated that pIC priming enhanced the early cardiogenic and Notch signaling programs. When both groups were differentiated in basal media, primed hiPS-CPCs gave rise to more mature cardiomyocytes based on larger cell size, increased optical action potential upstroke velocity, greater oxidative metabolism, enhanced sarcomere maturation, and upregulated transcriptional markers of CM maturation including cTnI, cardiac actin, and alpha MHC. These maturation effects of pIC treatment were blocked by the Notch inhibitor DAPT. Most impressively, primed hiPS-CPCs improved survival as well as myocardial systolic/diastolic function in a mouse model of myocardial infarction."
    }
  ],
  "skills": [
    {
      "name": "Technical Product Management",
      "level": "Advanced",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Technical Program Management",
      "level": "Advanced",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Technical Portfolio Management",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Artificial Intelligence",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Machine Learning",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Software Architecture",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Business Analytics",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Business Strategy",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    },
    {
      "name": "Data Science",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native",
      "icon": ""
    },
    {
      "language": "Italian",
      "fluency": "Elementary",
      "icon": ""
    },
    {
      "language": "Latin",
      "fluency": "Elementary",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Artificial Intelligence",
      "icon": "fa-solid fa-tag",
      "keywords": []
    },
    {
      "name": "Classical Piano",
      "icon": "fa-solid fa-tag",
      "keywords": []
    },
    {
      "name": "Hiking",
      "icon": "fa-solid fa-tag",
      "keywords": []
    },
    {
      "name": "Reading",
      "icon": "fa-solid fa-tag",
      "keywords": []
    }
  ],
  "projects": [
    {
      "name": "CODAmarket",
      "summary": "An e-commerce marketplace for public artists and enthusiasts.",
      "highlights": ["E-Commerce", "Commissioned Art"],
      "startDate": "2021",
      "endDate": "2023",
      "url": ""
    },
    {
      "name": "Gallify",
      "summary": "An AR/VR art marketplace built for digital creators and enthusiasts.",
      "highlights": ["Augmented Reality", "Computer Vision", "Blockchain", "E-Commerce"],
      "startDate": "2017",
      "endDate": "2019",
      "url": ""
    }
  ]
}